In [ ]:
## hello
!pip3 install sqlalchemy # ORM for databases
!pip3 install ipython-sql # SQL magic function

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.43)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.13.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (2.0.1)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (4.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.10.0)
Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.7/dist-packages (0.3.9)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.4.43)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: prettytable in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (3.5.0)
Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql) (7.9.0)
Requirement already satisfied: decorator in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: jedi>=0.10 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pygments in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (2.0.10)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: pexpect in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (57.4.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /usr/local/lib/python3.7/dist-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.7/dist-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (4.13.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql) (2.0.1)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (4.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql) (3.10.0)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.7/dist-packages (from pexpect->ipython>=1.0->ipython-sql) (0.7.0)

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## 1. Connect With Your Credentials

The current connection string DOES NOT WORK!   
Make sure to change the YOURUSER:YOURPASSWORD part of the connection string to your team's account information!

In [ ]:
%sql postgresql://jy3280:6858@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2

'Connected: jy3280@proj1part2'

In [ ]:
%sql SELECT current_database()

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.

[('proj1part2',)]

In [ ]:
# change your password
%%sql ALTER ROLE jy3280   
WITH PASSWORD '6858';

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

## 2. Create Tables for Entities and Relationships

In [ ]:
# create table
%%sql 
CREATE TABLE Restaurants (
	rid int,
  name text,
	cuisine text,
  price_level int,
  contact int,
  PRIMARY KEY (rid)
)

In [ ]:
%%sql
CREATE TABLE Food (
	fid int,
	name text,
	price float,
	hot_cold bool,
	PRIMARY KEY (fid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Users (
	uid int,
	name text,
	gender text,
	preference text,
	PRIMARY KEY (uid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Locations (
	lid int,
	district text,
	street text,
	building text,
	zip_code int,
	PRIMARY KEY (lid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Inspections (
	iid int,
	grade char,
	violation text,
	PRIMARY KEY (iid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Visit_Date (
  visit_date date,
  PRIMARY KEY (visit_date)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Serves(
  rid int REFERENCES Restaurants,
  fid int REFERENCES Food,
  PRIMARY KEY (rid, fid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Locates_at(
	rid int UNIQUE REFERENCES Restaurants,
	lid int UNIQUE REFERENCES Locations,
	PRIMARY KEY (rid, lid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Dines_at(
	uid int REFERENCES Users,
	rid int REFERENCES Restaurants,
	visit_date date REFERENCES Visit_Date, 
	PRIMARY KEY (uid, rid, visit_date)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Undergoes(
	rid int NOT NULL REFERENCES Restaurants,
	iid int REFERENCES Inspections,
	PRIMARY KEY (iid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Comments_left (
	cid int,
	ratings int,
	comment text,
	uid int NOT NULL,
	rid int NOT NULL, 
	visit_date date NOT NULL,
	PRIMARY KEY (cid),
	FOREIGN KEY (uid, rid, visit_date) REFERENCES Dines_at
		ON DELETE CASCADE
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Orders (
  oid int,
  order_date date,
  price float,
  details text,
  PRIMARY KEY (oid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Driver (
  did int,
  name text,
  rating float,
  mode_of_transportation text,
  phone bigint,
  PRIMARY KEY (did)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Delivers (
  did int NOT NULL REFERENCES Driver,
  oid int REFERENCES Orders,
  PRIMARY KEY (oid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Prepares (
  rid int NOT NULL REFERENCES Restaurants,
  oid int REFERENCES Orders,
  PRIMARY KEY (oid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Orders_food (
  uid int NOT NULL REFERENCES Users,
  oid int REFERENCES Orders,
  rating float,
  PRIMARY KEY (oid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Sent_to (
  oid int REFERENCES Orders,
  lid int NOT NULL REFERENCES Locations,
  PRIMARY KEY (oid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Permanently_lives_at (
  uid int REFERENCES Users,
  lid int NOT NULL REFERENCES Locations,
  PRIMARY KEY (uid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Inspector (
  inid int,
  company_name text,
  reliability text,
  public_private bool,
  PRIMARY KEY (inid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Conducts (
  iid int REFERENCES Inspections,
  inid int NOT NULL REFERENCES Inspector,
  PRIMARY KEY (iid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%%sql
CREATE TABLE Established_at (
  inid int REFERENCES Inspector,
  lid int UNIQUE NOT NULL REFERENCES Locations,
  PRIMARY KEY (inid)
)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

## 3. Populate Database with Data

In [ ]:
%%sql
INSERT INTO Users (uid, name, gender, preference) VALUES (1, 'Tom', 'm', 'Chinese');
INSERT INTO Users (uid, name, gender, preference) VALUES (2, 'Jerry', 'm', 'English');
INSERT INTO Users (uid, name, gender, preference) VALUES (3, 'Jack', 'm', 'American');
INSERT INTO Users (uid, name, gender, preference) VALUES (4, 'Hannah', 'f', 'Chinese');
INSERT INTO Users (uid, name, gender, preference) VALUES (5, 'Jennie', 'f', 'Japanese');
INSERT INTO Users (uid, name, gender, preference) VALUES (6, 'Henry', 'm', 'Korean');
INSERT INTO Users (uid, name, gender, preference) VALUES (7, 'Slovia', 'f', 'Viewtnamnese');
INSERT INTO Users (uid, name, gender, preference) VALUES (8, 'Brown', 'm', 'French');
INSERT INTO Users (uid, name, gender, preference) VALUES (9, 'Alan', 'm', 'Italian');
INSERT INTO Users (uid, name, gender, preference) VALUES (10, 'Sam', 'm', 'Mexican');

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Food (fid, name, price, hot_cold) VALUES (1, 'Burger', '23', 'True');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (2, 'Fries', '15.99', 'False');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (3, 'Veggies Pie', '2', 'True');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (4, 'Chowder', '17', 'True');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (5, 'Fish', '16', 'False');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (6, 'Bugolgi', '14', 'True');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (7, 'Mapo Tofu', '26', 'True');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (8, 'Ramen Soup', '14', 'False');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (9, 'Jalapeno', '16', 'True');
INSERT INTO Food (fid, name, price, hot_cold) VALUES (10, 'Chips', '17', 'False');

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (1, 'NOTARO RESTAURANT', 'Italian', 5, 2126863400);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (2, 'VITE BAR', 'Italian', 5, 3478134702);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (3, 'TACKS CHINESE TAKE OUT', 'Chinese', 2, 7189839854);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (4, 'NO QUARTER', 'American', 4, 7187019180);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (5, 'KABAB HOUSE NYC', 'Pakistani', 4, 9172852796);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (6, 'HENRIS BACKYARD', 'American', 3, 9293378443);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (7, 'RICHMOND COUNTY COUNTRY CLUB', 'American', 2, 7183510600);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (8, 'PLANET WINGS', 'American', 5, 7187209464);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (9, 'TOMOE SUSHI', 'Japanese', 5, 2127779346);
INSERT INTO Restaurants(rid, name, cuisine, price_level, contact) VALUES (10, 'YAKITORI TAISHO', 'Japanese', 4, 2122285086);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (1, 'MANHATTAN', 'SECOND AVENUE', '635', 10016);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (2, 'QUEENS', 'BROADWAY', '2507', 11106);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (3, 'STATEN ISLAND', 'HOLDEN BLVD', '11C', 10314);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (4, 'BROOKLYN', '5 AVENUE', '8015', 11209);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (5, 'QUEENS', 'MAIN ST', '4339', 11355);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (6, 'BROOKLYN', '4TH AVE', '256', 11215);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (7, 'STATEN ISLAND', 'TODT HILL ROAD', '1122', 10304);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (8, 'STATEN ISLAND', 'FOREST AVENUE', '480', 10310);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (9, 'MANHATTAN', 'THOMPSON STREET', '172', 10012);
INSERT INTO Locations(lid, district, street, building, zip_code) VALUES (10, 'MANHATTAN', 'ST MARKS PLACE', '5', 10003);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Inspections(iid, grade, violation) VALUES (1, 'C', 'Hot food item not held at or above 140Âº F.');
INSERT INTO Inspections(iid, grade, violation) VALUES (2, 'A', 'Non-food contact surface improperly constructed. Unacceptable material used. Non-food contact surface or equipment improperly maintained and/or not properly sealed, raised, spaced or movable to allow accessibility for cleaning on all sides, above and underneath the unit.');
INSERT INTO Inspections(iid, grade, violation) VALUES (3, 'C', 'Cold food item held above 41Âº F (smoked fish and reduced oxygen packaged foods above 38 ÂºF) except during necessary preparation.');
INSERT INTO Inspections(iid, grade, violation) VALUES (4, 'B', 'Live roaches present in facilitys food and/or non-food areas.');
INSERT INTO Inspections(iid, grade, violation) VALUES (5, 'B', 'Non-food contact surface improperly constructed. Unacceptable material used. Non-food contact surface or equipment improperly maintained and/or not properly sealed, raised, spaced or movable to allow accessibility for cleaning on all sides, above and underneath the unit.');
INSERT INTO Inspections(iid, grade, violation) VALUES (6, 'C', 'Evidence of rats or live rats present in facilitys food and/or non-food areas.');
INSERT INTO Inspections(iid, grade, violation) VALUES (7, 'A', 'Cold food item held above 41Âº F (smoked fish and reduced oxygen packaged foods above 38 ÂºF) except during necessary preparation.');
INSERT INTO Inspections(iid, grade, violation) VALUES (8, 'C', 'Cold food item held above 41Âº F (smoked fish and reduced oxygen packaged foods above 38 ÂºF) except during necessary preparation.');
INSERT INTO Inspections(iid, grade, violation) VALUES (9, 'A', 'Cold food item held above 41Âº F (smoked fish and reduced oxygen packaged foods above 38 ÂºF) except during necessary preparation.');
INSERT INTO Inspections(iid, grade, violation) VALUES (10, 'A', 'Plumbing not properly installed or maintained; anti-siphonage or backflow prevention device not provided where required; equipment or floor not properly drained; sewage disposal system in disrepair or not functioning properly.');

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Visit_Date(visit_date) VALUES ('2020-05-12');
INSERT INTO Visit_Date(visit_date) VALUES ('2019-06-24');
INSERT INTO Visit_Date(visit_date) VALUES ('2022-03-12');
INSERT INTO Visit_Date(visit_date) VALUES ('2020-05-15');
INSERT INTO Visit_Date(visit_date) VALUES ('2020-05-13');
INSERT INTO Visit_Date(visit_date) VALUES ('2010-10-03');
INSERT INTO Visit_Date(visit_date) VALUES ('2017-03-26');
INSERT INTO Visit_Date(visit_date) VALUES ('2009-03-10');
INSERT INTO Visit_Date(visit_date) VALUES ('2021-04-05');
INSERT INTO Visit_Date(visit_date) VALUES ('2022-10-13');

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Locates_at(rid, lid) VALUES (1, 1);
INSERT INTO Locates_at(rid, lid) VALUES (2, 2);
INSERT INTO Locates_at(rid, lid) VALUES (3, 3);
INSERT INTO Locates_at(rid, lid) VALUES (4, 4);
INSERT INTO Locates_at(rid, lid) VALUES (5, 5);
INSERT INTO Locates_at(rid, lid) VALUES (6, 6);
INSERT INTO Locates_at(rid, lid) VALUES (7, 7);
INSERT INTO Locates_at(rid, lid) VALUES (8, 8);
INSERT INTO Locates_at(rid, lid) VALUES (9, 9);
INSERT INTO Locates_at(rid, lid) VALUES (10, 10);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Undergoes(rid, iid) VALUES (1, 1);
INSERT INTO Undergoes(rid, iid) VALUES (2, 2);
INSERT INTO Undergoes(rid, iid) VALUES (3, 3);
INSERT INTO Undergoes(rid, iid) VALUES (4, 4);
INSERT INTO Undergoes(rid, iid) VALUES (5, 5);
INSERT INTO Undergoes(rid, iid) VALUES (6, 6);
INSERT INTO Undergoes(rid, iid) VALUES (7, 7);
INSERT INTO Undergoes(rid, iid) VALUES (8, 8);
INSERT INTO Undergoes(rid, iid) VALUES (9, 9);
INSERT INTO Undergoes(rid, iid) VALUES (10, 10);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Serves(rid, fid) VALUES (9, 8);
INSERT INTO Serves(rid, fid) VALUES (1, 10);
INSERT INTO Serves(rid, fid) VALUES (2, 5);
INSERT INTO Serves(rid, fid) VALUES (1, 6);
INSERT INTO Serves(rid, fid) VALUES (7, 4);
INSERT INTO Serves(rid, fid) VALUES (3, 1);
INSERT INTO Serves(rid, fid) VALUES (8, 1);
INSERT INTO Serves(rid, fid) VALUES (2, 10);
INSERT INTO Serves(rid, fid) VALUES (3, 2);
INSERT INTO Serves(rid, fid) VALUES (4, 1);
INSERT INTO Serves(rid, fid) VALUES (10, 7);
INSERT INTO Serves(rid, fid) VALUES (8, 10);
INSERT INTO Serves(rid, fid) VALUES (3, 9);
INSERT INTO Serves(rid, fid) VALUES (6, 8);
INSERT INTO Serves(rid, fid) VALUES (2, 8);
INSERT INTO Serves(rid, fid) VALUES (1, 3);
INSERT INTO Serves(rid, fid) VALUES (7, 8);
INSERT INTO Serves(rid, fid) VALUES (6, 5);
INSERT INTO Serves(rid, fid) VALUES (5, 4);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (4, 3, '2020-05-12');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (3, 8, '2019-06-24');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (3, 2, '2022-03-12');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (2, 6, '2020-05-15');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (5, 5, '2020-05-13');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (4, 6, '2010-10-03');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (1, 3, '2017-03-26');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (5, 5, '2009-03-10');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (4, 4, '2021-04-05');
INSERT INTO Dines_at(uid, rid, visit_date) VALUES (7, 3, '2022-10-13');

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (1, 4, 'Food is oily', 4, 3, '2020-05-12');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (2, 3, 'Service is friendly', 3, 8, '2019-06-24');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (3, 4, 'I don’t really like it here because location is inconvenient', 3, 2, '2022-03-12');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (4, 4, 'Good', 2, 6, '2020-05-15');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (5, 5, 'Tasty Michelin Level', 5, 5, '2020-05-13');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (6, 1, 'Will come again', 4, 6, '2010-10-03');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (7, 1, 'Overrated', 1, 3, '2017-03-26');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (8, 3, 'Too expensive!', 5, 5, '2009-03-10');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (9, 1, 'Fun place', 4, 4, '2021-04-05');
INSERT INTO Comments_left(cid, ratings, comment, uid, rid, visit_date) VALUES (10, 2, 'Good service overall', 7, 3, '2022-10-13');

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Orders(oid, order_date, price, details) VALUES (1, '2022-04-26', 23.28, 'Mapo-tofu, Kongpao Chicken');
INSERT INTO Orders(oid, order_date, price, details) VALUES (2, '2022-05-14', 111.2, 'Fish and Chips, Coleslaw, Fried Oyster');
INSERT INTO Orders(oid, order_date, price, details) VALUES (3, '2020-09-02', 150, 'Fatty Beef Over Rice, Beef Noodle');
INSERT INTO Orders(oid, order_date, price, details) VALUES (4, '2020-03-27', 35.77, 'Curry Chicken, beef kebab');
INSERT INTO Orders(oid, order_date, price, details) VALUES (5, '2017-12-23', 40.23, 'Angus Steak, Popcorn Shrimp, Lamb Leg');
INSERT INTO Orders(oid, order_date, price, details) VALUES (6, '2022-10-08', 52.56, 'Wine Snails, Chicken Stew');
INSERT INTO Orders(oid, order_date, price, details) VALUES (7, '2022-01-25', 100, 'Sea Cucumber Soup, Barbecue Chicken Leg, Corona Beer');
INSERT INTO Orders(oid, order_date, price, details) VALUES (8, '2019-07-17', 121.33, 'Italian Sausage, Broccoli Pasta');
INSERT INTO Orders(oid, order_date, price, details) VALUES (9, '2022-08-04', 19.18, 'Barbecue Pineapple Chicken Pizza');
INSERT INTO Orders(oid, order_date, price, details) VALUES (10, '2022-11-11', 35.55, 'Classic Pork Ramen, Fried Calamari, California Roll');

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (1, 'David Blair', 5.0, 'car', 3134640328);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (2, 'Kathy McArthur', 4.8, 'motorcycle', 7732594976);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (3, 'Winston Churnochill', 3.3, 'bike', 2425954961);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (4, 'John Kendy', 4.5, 'walk', 1342563567);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (5, 'Daniel Pho', 4.7, 'bike', 9813645869);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (6, 'David Wang', 4.9, 'bike', 6467071834);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (7, 'Eugene Fu', 5.0, 'car', 1356810639);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (8, 'Joe Ciden', 4.4, 'motorcycle', 1452563745);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (9, 'Donald Pump', 4.5, 'walk', 1234567890);
INSERT INTO Driver(did, name, rating, mode_of_transportation, phone) VALUES (10, 'Barack Chopbama', 4.6, 'car', 5823756789);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Orders_food(uid, oid, rating) VALUES (10, 6, 4);
INSERT INTO Orders_food(uid, oid, rating) VALUES (8, 4, 3);
INSERT INTO Orders_food(uid, oid, rating) VALUES (9, 3, 4);
INSERT INTO Orders_food(uid, oid, rating) VALUES (1, 10, 4);
INSERT INTO Orders_food(uid, oid, rating) VALUES (2, 1, 5);
INSERT INTO Orders_food(uid, oid, rating) VALUES (7, 2, 5);
INSERT INTO Orders_food(uid, oid, rating) VALUES (4, 7, 3);
INSERT INTO Orders_food(uid, oid, rating) VALUES (7, 5, 4);
INSERT INTO Orders_food(uid, oid, rating) VALUES (10, 8, 5);
INSERT INTO Orders_food(uid, oid, rating) VALUES (3, 9, 2);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Delivers(did, oid) VALUES (5, 6);
INSERT INTO Delivers(did, oid) VALUES (5, 4);
INSERT INTO Delivers(did, oid) VALUES (3, 3);
INSERT INTO Delivers(did, oid) VALUES (2, 10);
INSERT INTO Delivers(did, oid) VALUES (7, 1);
INSERT INTO Delivers(did, oid) VALUES (2, 2);
INSERT INTO Delivers(did, oid) VALUES (3, 7);
INSERT INTO Delivers(did, oid) VALUES (10, 5);
INSERT INTO Delivers(did, oid) VALUES (1, 8);
INSERT INTO Delivers(did, oid) VALUES (5, 9);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Prepares(rid, oid) VALUES (8, 3);
INSERT INTO Prepares(rid, oid) VALUES (3, 8);
INSERT INTO Prepares(rid, oid) VALUES (9, 6);
INSERT INTO Prepares(rid, oid) VALUES (7, 9);
INSERT INTO Prepares(rid, oid) VALUES (6, 10);
INSERT INTO Prepares(rid, oid) VALUES (6, 5);
INSERT INTO Prepares(rid, oid) VALUES (8, 2);
INSERT INTO Prepares(rid, oid) VALUES (2, 1);
INSERT INTO Prepares(rid, oid) VALUES (6, 4);
INSERT INTO Prepares(rid, oid) VALUES (8, 7);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Sent_to(oid, lid) VALUES (1, 5);
INSERT INTO Sent_to(oid, lid) VALUES (5, 2);
INSERT INTO Sent_to(oid, lid) VALUES (2, 6);
INSERT INTO Sent_to(oid, lid) VALUES (6, 7);
INSERT INTO Sent_to(oid, lid) VALUES (3, 4);
INSERT INTO Sent_to(oid, lid) VALUES (8, 6);
INSERT INTO Sent_to(oid, lid) VALUES (9, 6);
INSERT INTO Sent_to(oid, lid) VALUES (10, 8);
INSERT INTO Sent_to(oid, lid) VALUES (7, 9);
INSERT INTO Sent_to(oid, lid) VALUES (4, 3);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Permanently_lives_at(uid, lid) VALUES (1, 3);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (4, 4);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (5, 6);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (3, 3);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (8, 4);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (2, 2);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (9, 7);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (7, 9);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (10, 10);
INSERT INTO Permanently_lives_at(uid, lid) VALUES (6, 1);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (1, 'Green Howtai', 'low', 'False');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (2, 'Happy Safety', 'medium', 'False');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (3, 'NYC Health Bureau', 'high', 'True');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (4, 'NYC Restaurant Association', 'high', 'True');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (5, 'No Mice', 'medium', 'False');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (6, 'Pollution Free', 'medium', 'False');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (7, 'FDA', 'high', 'True');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (8, 'Controllers', 'high', 'False');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (9, 'Clean Food Initiative', 'medium', 'False');
INSERT INTO Inspector(inid, company_name, reliability, public_private) VALUES (10, 'Beware Food', 'low', 'False');

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Conducts(iid, inid) VALUES (8, 5);
INSERT INTO Conducts(iid, inid) VALUES (6, 7);
INSERT INTO Conducts(iid, inid) VALUES (1, 6);
INSERT INTO Conducts(iid, inid) VALUES (3, 8);
INSERT INTO Conducts(iid, inid) VALUES (2, 4);
INSERT INTO Conducts(iid, inid) VALUES (7, 7);
INSERT INTO Conducts(iid, inid) VALUES (4, 6);
INSERT INTO Conducts(iid, inid) VALUES (10, 3);
INSERT INTO Conducts(iid, inid) VALUES (9, 4);
INSERT INTO Conducts(iid, inid) VALUES (5, 5);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Established_at(inid, lid) VALUES (7, 5);
INSERT INTO Established_at(inid, lid) VALUES (8, 6);
INSERT INTO Established_at(inid, lid) VALUES (1, 7);
INSERT INTO Established_at(inid, lid) VALUES (5, 3);
INSERT INTO Established_at(inid, lid) VALUES (3, 2);
INSERT INTO Established_at(inid, lid) VALUES (9, 1);
INSERT INTO Established_at(inid, lid) VALUES (10, 4);
INSERT INTO Established_at(inid, lid) VALUES (6, 8);
INSERT INTO Established_at(inid, lid) VALUES (2, 9);
INSERT INTO Established_at(inid, lid) VALUES (4, 10);

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## 4. Three interesting Queries

In [ ]:
## find the earliest instance in the entire database where any user visted any restaurant
%%sql
SELECT U.name AS early_user, R.name AS early_restaurant
FROM Users AS U, Restaurants AS R, Dines_at AS D
WHERE U.uid = D.uid AND R.rid = D.rid AND D.visit_date = (SELECT MIN(visit_date) FROM Dines_at)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
1 rows affected.

[('Jennie', 'KABAB HOUSE NYC')]

In [ ]:
## Find the restaurants with inspection grade at least as good as B
%%sql
SELECT R.name AS Good_Restaurants
FROM Restaurants R INNER JOIN Undergoes U
ON R.rid = U.rid
INNER JOIN Inspections I 
ON U.iid = I.iid
WHERE I.grade <= 'B'

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
6 rows affected.

[('VITE BAR',),
 ('NO QUARTER',),
 ('KABAB HOUSE NYC',),
 ('RICHMOND COUNTY COUNTRY CLUB',),
 ('TOMOE SUSHI',),
 ('YAKITORI TAISHO',)]

In [ ]:
## Select restaurants that have been visited more than once
%%sql
WITH C(rid, ct) AS (SELECT D1.rid, COUNT(*) FROM Dines_at AS D1 GROUP BY D1.rid)
SELECT DISTINCT R.name
FROM Restaurants AS R, Dines_at AS D, C
WHERE R.rid = D.rid AND R.rid = C.rid AND C.ct > 1

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
3 rows affected.

[('KABAB HOUSE NYC',), ('HENRIS BACKYARD',), ('TACKS CHINESE TAKE OUT',)]

In [ ]:
## Selects the driver(drivers if there are ties) that has the highest overall rating
%%sql
SELECT name FROM Driver
WHERE rating = (SELECT MAX(rating) FROM Driver)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
2 rows affected.

[('David Blair',), ('Eugene Fu',)]

In [ ]:
## Find all the drivers who has ever delivered for Sam
%%sql
SELECT DISTINCT D.name 
FROM Driver AS D, Delivers AS De, Orders AS O,  Orders_food AS Of, Users AS U
WHERE D.did = De.did AND O.oid = De.oid AND O.oid = Of.oid AND U.uid = Of.uid AND U.name = 'Sam'

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
2 rows affected.

[('Daniel Pho',), ('David Blair',)]

In [ ]:
## Find inspector companies who has never conducted any inspections and their corresponding reliability level
%%sql
SELECT DISTINCT Ins.company_name, Ins.reliability
FROM Inspector AS Ins, Conducts AS C, Inspections AS I
WHERE NOT EXISTS (SELECT Ins1 FROM Inspector AS Ins1, Conducts AS C1,  Inspections AS I1 WHERE I1.iid = C1.iid AND C1.inid = Ins.inid)

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
4 rows affected.

[('Green Howtai', 'low'),
 ('Happy Safety', 'medium'),
 ('Clean Food Initiative', 'medium'),
 ('Beware Food', 'low')]

## 5. Helper Functions

In [ ]:
%sql DELETE FROM L

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
10 rows affected.

[]

In [ ]:
# see table R
%sql SELECT * FROM Orders_food;

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
5 rows affected.

[(10, 6, 4.0), (8, 4, 3.0), (9, 3, 4.0), (1, 10, 4.0), (2, 1, 5.0)]

In [ ]:
# see all the tables you have
%%sql SELECT *
FROM pg_catalog.pg_tables
WHERE tableowner='jy3280'

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
21 rows affected.

[('jy3280', 'serves', 'jy3280', None, True, False, True, False),
 ('jy3280', 'locates_at', 'jy3280', None, True, False, True, False),
 ('jy3280', 'visit_date', 'jy3280', None, True, False, True, False),
 ('jy3280', 'undergoes', 'jy3280', None, True, False, True, False),
 ('jy3280', 'dines_at', 'jy3280', None, True, False, True, False),
 ('jy3280', 'comments_left', 'jy3280', None, True, False, True, False),
 ('jy3280', 'users', 'jy3280', None, True, False, True, False),
 ('jy3280', 'locations', 'jy3280', None, True, False, True, False),
 ('jy3280', 'inspections', 'jy3280', None, True, False, True, False),
 ('jy3280', 'restaurants', 'jy3280', None, True, False, True, False),
 ('jy3280', 'food', 'jy3280', None, True, False, True, False),
 ('jy3280', 'permanently_lives_at', 'jy3280', None, True, False, True, False),
 ('jy3280', 'orders_food', 'jy3280', None, True, False, True, False),
 ('jy3280', 'driver', 'jy3280', None, True, False, True, False),
 ('jy3280', 'prepares', 'jy3280', None, True, False, True, False),
 ('jy3280', 'delivers', 'jy3280', None, True, False, True, False),
 ('jy3280', 'sent_to', 'jy3280', None, True, False, True, False),
 ('jy3280', 'orders', 'jy3280', None, True, False, True, False),
 ('jy3280', 'conducts', 'jy3280', None, True, False, True, False),
 ('jy3280', 'inspector', 'jy3280', None, True, False, True, False),
 ('jy3280', 'established_at', 'jy3280', None, True, False, True, False)]

In [ ]:
%sql DROP TABLE established_at

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]

In [ ]:
%sql ALTER TABLE Driver ALTER COLUMN phone TYPE bigint;

 * postgresql://jy3280:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/proj1part2
Done.

[]